const { expectToBe } = require("./utils");

test("Цифры", () => {
  expectToBe(0, "ноль");
  expectToBe(-0, "ноль");
  expectToBe(1, "один");
  expectToBe("000001", "один");
  expectToBe(7, "семь");
});

test("Числа от 10 до 20", () => {
  expectToBe(10, "десять");
  expectToBe(15, "пятнадцать");
  expectToBe(19, "девятнадцать");
});

test("Числа от 20 до 100", () => {
  expectToBe(20, "двадцать");
  expectToBe(31, "тридцать один");
  expectToBe(99, "девяносто девять");
});

test("Числа от 100 до 1000", () => {
  expectToBe(100, "сто");
  expectToBe(132, "сто тридцать два");
  expectToBe(999, "девятьсот девяносто девять");
})

test("Числа от 1000 до 10000", () => {
  expectToBe(1000, "одна тысяча"); 
  expectToBe(2152, "две тысячи сто пятьдесят два");
  expectToBe(9999, "девять тысяч девятьсот девяносто девять");
})

test("Числа от 10-и тысяч до 1-го миллиона", () => {
  expectToBe(10000, "десять тысяч");
  expectToBe(21000, "двадцать одна тысяча");
  expectToBe(95325, "девяносто пять тысяч триста двадцать пять");
})
